package th.com.bloomcode.paymentservice.model;

public enum Message {

    /*
     * 516, 550 begin
     * */
    MESSAGE_516("516", "เริ่มงาน"),
    MESSAGE_550("550", "ขั้นตอนที่ {0,number,000} เริ่ม (โปรแกรม {1}, ชุดตัวเลือก {2}, ผู้ประมวลผล {3})"),

    /*
     * 398, 517 end
     * */
    MESSAGE_398("398", "สิ้นสุดรายงาน"),
    MESSAGE_517("517", "เสร็จงาน"),

    /*
     * 401, 402 choose only one
     * 401 for payment run
     * 402 for proposal run
     * */
    MESSAGE_401("401", "รายงานการตรวจสอบการประมวลผลการชำระเงิน {0,date,dd-MM-yyyy}, การระบุ {1}"),
    MESSAGE_402("402", "รายงานการตรวจสอบการประมวลผลข้อเสนอการชำระเงิน {0,date,dd-MM-yyyy}, การระบุ {1}"),

    /*
     * 693 for new group log
     * */
    MESSAGE_693("693", ">"),

    /*
     * 691 for each vendor
     * */
    MESSAGE_691("691", "รายงานการตรวจสอบเพิ่มเติมสำหรับผู้ขาย {0} รหัสหน่วยงาน {1}"),

    /*
     * 799-721 for addition due date
     * */
    MESSAGE_799("799", "> ---------- รายงานตรวจสอบเพิ่มเติมการกำหนดวันที่ครบกำหนด"),
    MESSAGE_700("700", "> เอกสาร {0} บรรทัดรายการ {1,number,000} ผ่านทาง {2}  {3,number,0.00}"),
    MESSAGE_735("735", "> การชำระเงินตามผู้รับเงิน/ผู้ชำระเงิน {0}"), // show when if payee code
    MESSAGE_701("701", "> เงื่อนไขการชำระเงิน: {0,date,dd-MM-yyyy}  {1} {2,number,0.000} %   {3} {4,number,0.000} %   {5}"),
    MESSAGE_726("726", "> กำลังพิจารณาช่วงเวลาผ่อนผัน {0,number,00}"),
    MESSAGE_719("719", "> การอ้างถึงเอกสารตั้งเบิก, ได้คัดลอกข้อมูลจากบรรทัดรายการเอกสารตั้งเบิก {0} {1}"), // show when invoice reference type <> 'P' || specialGL <> ''
    MESSAGE_720("720", "> ไม่ได้รวมรายการนี้"),
    MESSAGE_728("728", "> ต้องชำระเงินก่อน {0,date,dd-MM-yyyy}; การชำระครั้งต่อไป {1,date,dd-MM-yyyy}"),
    MESSAGE_721("721", "> บรรทัดรายการถึงกำหนดโดยมีส่วนลดเงินสด {0,number,0.000} %"),
    MESSAGE_708("708", "> วันที่ผ่านรายการในการประมวลผลครั้งนี้ {0,date,dd-MM-yyyy}, การประมวลผลครั้งต่อไป {1,date,dd-MM-yyyy}"),

    /*
     * 716-718, 748, 749 choose only one
     * */
    MESSAGE_716("716", "> รายการถูกระงับด้วยคีย์ระงับ"),
    MESSAGE_717("717", "> บัญชีถูกระงับด้วยคีย์ระงับ"),
    MESSAGE_718("718", "> ผู้รับเงินถูกระงับด้วยคีย์ระงับ"),
    MESSAGE_748("748", "> บัญชีทำแฟลกเครื่องหมายลบ"),
    MESSAGE_749("749", "> ผู้รับเงินทำแฟลกเครื่องหมายลบ"),

    /*
     * 736-737 choose only one
     * */
    MESSAGE_736("736", "> ระงับบัญชีเนื่องจากไม่ยืนยันการเปลี่ยนแปลงข้อมูลหลัก"),
    MESSAGE_737("737", "> ระงับผู้รับเงินเนื่องจากไม่ยืนยันการเปลี่ยนแปลงข้อมูลหลัก"),
    MESSAGE_738("738", "> ระงับบัญชีเนื่องจากมีการปฎิเสธการเปลี่ยนแปลงข้อมูลหลัก"),
    MESSAGE_739("739", "> ระงับผู้รับเงินเนื่องจากมีการปฎิเสธการเปลี่ยนแปลงข้อมูลหลัก"),

    /*
     * 699-609 for payment method all case
     * */
    MESSAGE_699("699", "> ---------- รายงานการตรวจสอบเพิ่มเติมการเลือกวิธีชำระเงิน"),
    MESSAGE_601("601", "> การเลือกวิธีการชำระเงินสำหรับรายการที่ครบกำหนดตอนนี้ในจำนวนเงิน {0} {1}"),
    MESSAGE_602("602", "> การเลือกวิธีการชำระเงินสำหรับรายการที่ครบกำหนด {0} ในจำนวนเงิน {1} {2}"),
    MESSAGE_604("604", "> วิธีการชำระเงิน '{0}' ในเอกสารไม่ควรนำมาพิจารณาในการประมวลผลนี้"),
    MESSAGE_608("608", "> ไม่ปรากฏวิธีการชำระเงินที่อนุญาต"),


    /*
     * 603-663
     * *
     */
    MESSAGE_603("603", "> วิธีการชำระเงิน {0} กำลังตรวจสอบ"),
    MESSAGE_640("640", "> รายละเอียดธนาคารกำลังตรวจสอบ"),
    MESSAGE_644("644", "> รายละเอียดธนาคารของผู้ขาย กำลังได้รับการอ่าน"),
    MESSAGE_645("645", "> ประเทศ {0} / รหัสธนาคาร {1} / บัญชี {2}"),
    MESSAGE_665("665", "> รายละเอียดธนาคารของผู้ขาย กำลังได้รับการตรวจสอบ"),
    MESSAGE_663("663", "> รายละเอียดธนาคาร {0} {1} มีประเภทธนาคาร {2} ประเภทธนาคาร {3} "),

    /*
     * 668-648
     * *
     */
    MESSAGE_668("668", "> ระบบอ่านธนาคารและตรวจสอบว่าธนาคารเหล่านั้นได้รับการอนุญาตหรือไม่"),
    MESSAGE_648("648", "> ธนาคารของเรา {0} กำลังถูกตรวจสอบ"),

    MESSAGE_658("658", "> สกุลเงิน {0} และ  {1} วัน {2} ได้วางแผน"),

    MESSAGE_656("656", "> จำนวนเงินที่จัดหาได้น้อยเกินไป,& & ยังคงจัดหา, & & จำเป็น"),
    MESSAGE_657("657", "> จำนวนเงินที่จัดหาเพียงพอ,& & ยังคงจัดหา, & & จำเป็น"),

    MESSAGE_641("641", "> รายละเอียดธนาคารของเรา {0} {1} กำลังใช้อยู่"),
    MESSAGE_642("642", "> รายละเอียดธนาคารของคู่ค้าประเทศ {0} {1} {2} กำลังใช้อยู่"),
    MESSAGE_609("609", "> อนุญาตให้ใช้วิธีการชำระเงิน {0}"),

    /*
     * 798-744 for payment method all case
     * */
    MESSAGE_798("798", "> ---------- รายงานการตรวจสอบเพิ่มเติมเอกสารผ่านรายการ"),
    MESSAGE_741("741", "> เอกสาร {0} รหัสหน่วยงาน {1} สกุลเงิน {2} วิธีการชำระเงิน {3}"),
    MESSAGE_743("743", "> LIt  |   PK     |   Acct     |   Amount   |  Tax    "),
    MESSAGE_744("744", "> {0,number,000} | {1} | {2}  |   {3,number,0.00}    |   {4,number,0.00} "),


    MESSAGE_500("500", "> เอกสาร {0} รหัสหน่วยงาน {1} ปีบัญชี {2} "),
    MESSAGE_503("503", "> รายการถูกระงับในการชำระเงิน"),
    MESSAGE_512("512", "> ยังไม่ถึงจำนวนเงินขั้นต่ำสำหรับการชำระเงิน"),
    MESSAGE_518("518", "> วิธีการชำระเงินในการประมวลผลครั้งนี้ไม่ได้ระบุในข้อมูลหลักหรือในรายการ"),
    MESSAGE_524("524", "> ข้อมูลหลักของผู้รับเงินหายไป"),
    MESSAGE_531("531", "> บัญชีได้รับการทำเครื่องหมายแฟลกสำหรับการลบ"),
    MESSAGE_571("571", "> ไม่พบธนาคารคู่ค้าที่ถูกต้อง"),
    MESSAGE_532("532", "> ข้อมูลผู้ขายมีสถานะ รอการยืนยัน"),
    MESSAGE_534("534", "> ข้อมูลผู้รับเงินมีสถานะ รอการยืนยัน"),
    MESSAGE_536("536", "> ข้อมูลผู้รับเงินมีสถานะ ไม่ยืนยัน"),
    MESSAGE_572("572", "> รหัสธนาคารได้รับการทำเครื่องหมายแฟลกสำหรับการลบ"),
    MESSAGE_573("573", "> รหัสธนาคารไม่ถูกต้อง");




    private final String messageNo;
    private final String messageText;

    Message(String messageNo, String messageText) {
        this.messageNo = messageNo;
        this.messageText = messageText;
    }

    public String getMessageNo() {
        return messageNo;
    }

    public String getMessageText() {
        return messageText;
    }
}
